#-*- coding: utf-8 -*-


def first():
    '''
    Научитесь вызывать ошибку: в интерактивном режиме введите название своего любимого сорта мороженого.
    Потом исправьте ошибку и создайте команду, которая будет правильным образом выводить на экран название
    этого сорта мороженого.
    '''
    icecream = 'snickers'
    print(icecream)
    print('- Конец первого задания -\n')

def second():
    '''
    Напишите и сохраните программу, которая будет выводить ваше имя и дожидаться, пока пользователь нажмет 
    Enter для выхода. Запустите эту программу, дважды щелкнув на ее значке.
    '''
    name = 'Илья'
    print(name)
    input('Нажмите Enter для выхода')
    print('- Конец второго задания -\n')

def third():
    '''
    Напишите программу, которая будет выводить на экран ваш любимый афоризм. Не забудьте о том, что автор
    афоризма должен быть упомянут на отдельной строке.
    '''
    afforism = 'Не тот велик, кто никогда не падал, а тот велик — кто падал и вставал.\n' \
            '\t\t\t\t\t\t\t\t\t\t\tКонфуций.'
    print(afforism)
    print('- Конец третьего задания -')
